# IsBasePanelFeedThroughLugsOccupied Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElectricalSystem..::..IsBasePanelFeedThroughLugsOccupied Property
ElectricalSystem Class See Also
---
Checks if the feed through lugs of the base panel is already occupied.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020
# Syntax
C#
---
```text
public bool IsBasePanelFeedThroughLugsOccupied { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsBasePanelFeedThroughLugsOccupied As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsBasePanelFeedThroughLugsOccupied {
	bool get ();
}
```

# See Also
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace